Revit 2027 API
BuiltInFailures.MechanicalFailures Class
 Failures about HVAC.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MechanicalFailures
Public NotInheritable Class MechanicalFailures
public ref class MechanicalFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MechanicalFailures = class end
The BuiltInFailures.MechanicalFailures type exposes the following members.
Properties
Name | Description
InitialEqualFrictionSizingFailed |  Initial Equal Friction Sizing failed.
LiningThicknessIsLargeForDiameter |  Lining Thickness ([Lining Thickness Value]) is too large for current Diameter ([Diameter Value]).
LiningThicknessIsLargeForHeight |  Lining Thickness ([Lining Thickness Value]) is too large for current Height ([Height Value]).
LiningThicknessIsLargeForWidth |  Lining Thickness ([Lining Thickness Value]) is too large for current Width ([Width Value]).
PanelDoesntMatchCircuitProperties |  The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?
PanelValidateConfigurationError |  More than one circuit falls onto the same slot. Disconnect the circuits from the panel?
TwoPointsSelectedBeforeEdit |  Two points have to be selected before existing the edit mode.
Top
See Also
Reference
Autodesk.Revit.DB Namespace